trade_exp/src/Catalogs/оп_АлгоритмыОбеспеченияПотребностей/оп_АлгоритмыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1656f9e3-402b-4cda-8c05-cade8211f967">
  <name>оп_АлгоритмыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1df4ad7a-ef23-4439-9a3c-e19877f53323">
    <name>ВидФормулыМакс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cbb02b65-7818-4603-ac86-4e4fb29886f6">
    <name>СпособФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a69d3f59-a567-4dff-875e-04da7319cf10">
    <name>ФормулаМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d227b77-055f-43dc-ad16-c29e32cd5d6b">
    <name>ВидФормулыМин</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7f8606e-fb92-4ecb-adfe-e2ef34fd8c2c">
    <name>ФормулаМин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="030c2534-28d6-4a95-8cf1-ae42be34fe75">
    <name>ТекстЗапроса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="848ebe9f-31e9-45d2-b73f-699924c76d6b">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4bf50ee7-8131-4dd1-b22e-98c4ffbd5833">
    <name>Показатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="41100ca9-54a9-40dc-92a3-10b4fb41b21b">
      <name>Показатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/оп_АлгоритмыОбеспеченияПотребностей/Forms/ФормаРедактированияФормулы/Module.bsl
&НаКлиенте
Процедура ПоказателиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
	
	Если Элемент.Имя = "Показатели" Тогда
		Идентификатор = ?(ПоказательСПараметром(Элемент.ТекущиеДанные.Показатель),ВозвратитьИдентификатор(Элемент.ТекущиеДанные.Показатель)+"[]",ВозвратитьИдентификатор(Элемент.ТекущиеДанные.Показатель));
		ПараметрыПеретаскивания.Значение = СокрЛП(Идентификатор);
	Иначе
		Выполнение = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦЕЛКоманда(Команда)
	ВставитьТекстВФормулу(" Цел() ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстВФормулу(ТекстДляВставки, Сдвиг=0, ПозицияКурсора=0)
	
	Модифицированность = Истина;
	
	ЭлементФормула = Элементы.Формула;
	ТекущийЭлемент = ЭлементФормула;
	
	СтрокаНач=0;
	СтрокаКон=0;
	КолонкаНач=0;
	КолонкаКон=0;
	
	ЭлементФормула.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	НуженПереносТекстаНаСледующуюСтроку = (КолонкаНач + СтрДлина(ТекстДляВставки)) > ЭлементФормула.Ширина;
	
	Если Не ЗначениеЗаполнено(Формула) Тогда // текста еще нет, запишем идентификатор с первой позиции
		ЭлементФормула.УстановитьГраницыВыделения(1,1,1,1);
		НуженПереносТекстаНаСледующуюСтроку = Ложь;
	ИначеЕсли НуженПереносТекстаНаСледующуюСтроку Тогда
	//    ЭлементФормула.ВыделенныйТекст = Символы.ПС;
	КонецЕсли;
		
	ЭлементФормула.ВыделенныйТекст = ТекстДляВставки;
	
	Если Сдвиг <> 0 Тогда
		
		ЭлементФормула.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
		ЭлементФормула.УстановитьГраницыВыделения(СтрокаНач, КолонкаНач + Сдвиг, СтрокаКон, КолонкаКон + Сдвиг);
		
		ЭлементФормула.ВыделенныйТекст = ТекстДляВставки;

	КонецЕсли;
	
	НижняяСтрокаТекста = СтрокаНач + ?(НуженПереносТекстаНаСледующуюСтроку, 1, 0);
	ПраваяГраницаТекста = ?(НуженПереносТекстаНаСледующуюСтроку, 1, КолонкаНач) + СтрДлина(ТекстДляВставки) - ПозицияКурсора;
	ЭлементФормула.УстановитьГраницыВыделения(НижняяСтрокаТекста, ПраваяГраницаТекста, НижняяСтрокаТекста, ПраваяГраницаТекста);
	
КонецПроцедуры // ВставитьТекстВФормулу()

&НаКлиенте
Процедура ТекущаяДатаПараметр(Команда)
	ВставитьТекстВФормулу(" ТекущаяДата ")
КонецПроцедуры

&НаКлиенте
Процедура СрокПоставки(Команда)
	ВставитьТекстВФормулу(" СрокПоставки ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ОКРКоманда(Команда)
	ВставитьТекстВФормулу(" Окр(,) ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечиваемыйПериод(Команда)
	ВставитьТекстВФормулу(" ОбеспечиваемыйПериод ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	
	Если Элементы.Показатели.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВФормулу(?(ПоказательСПараметром(Элемент.ТекущиеДанные.Показатель),ВозвратитьИдентификатор(Элементы.Показатели.ТекущиеДанные.Показатель)+"[]",ВозвратитьИдентификатор(Элементы.Показатели.ТекущиеДанные.Показатель)));

КонецПроцедуры
&НаСервере
Функция ПоказательСПараметром(Показатель)

возврат Показатель.ИспользоватьДату;	

КонецФункции // ПоказательСПараметром()
&НаСервере
Функция ВозвратитьИдентификатор(Показатель)

возврат Показатель.Идентификатор;	

КонецФункции // ПоказательСПараметром()

&НаКлиенте
Процедура ДобавитьВФормулу(Идентификатор)
	УстановитьТекстВПозициюКурсора(Идентификатор)	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекстВПозициюКурсора(Текст = "")
	
	НачальнаяСтрокаВыделения = 0; 
	НачальнаяКолонкаВыделения = 0; 
	КонечнаяСтрокаВыделения = 0; 
	КонечнаяКолонкаВыделения = 0;
	
	// Получим текущую позицию курсора.
	Элементы.Формула.ПолучитьГраницыВыделения(НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения, КонечнаяСтрокаВыделения, КонечнаяКолонкаВыделения);
	
	Если ПустаяСтрока(Текст) Тогда
		НачальнаяКолонкаВыделения = НачальнаяКолонкаВыделения + СтрДлина(Формула);
	Иначе
		Элементы.Формула.ВыделенныйТекст = Текст;
		Модифицированность = Истина;
		
		// Установим курсор после вставленного текста.
		НачальнаяКолонкаВыделения = НачальнаяКолонкаВыделения + СтрДлина(Текст);
	КонецЕсли;
	
	Элементы.Формула.УстановитьГраницыВыделения(НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения, НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения);
	
КонецПроцедуры


&НаКлиенте
Процедура НачалоМесяцаКоманда(Команда)
		ВставитьТекстВФормулу(" НачалоМесяца() ",,3)
КонецПроцедуры


&НаКлиенте
Процедура МИНКоманда(Команда)
		ВставитьТекстВФормулу(" МИН(,) ",,3)

КонецПроцедуры


&НаКлиенте
Процедура МАКСКоманда(Команда)
		ВставитьТекстВФормулу(" МАКС(,) ",,3)

КонецПроцедуры


&НаКлиенте
Процедура КонецМесяцаКоманда(Команда)
		ВставитьТекстВФормулу(" КонецМесяца() ",,3)

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьМесяцКоманда(Команда)
			ВставитьТекстВФормулу(" НачалоМесяца() ",,3)

КонецПроцедуры


&НаКлиенте
Процедура СпособОбеспеченияПриИзменении(Элемент)
	ЗаполнитьПараметрыОбеспечения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОбеспечения()

	 ОбеспечиваемыйПериод=СпособОбеспечения.ОбеспечиваемыйПериод;
	 Датапоставки=ТекущаяДата()+СпособОбеспечения.СрокИсполненияЗаказа*24*60*60;
	 Срокпоставки=СпособОбеспечения.СрокИсполненияЗаказа;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Формула = Параметры.Формула;
ВидФормулы = Параметры.ВидФормулы;
ТипФормулы = Параметры.ТипФормулы;
для каждого стр из Параметры.Показатели цикл
	Показатели.Добавить().Показатель=стр;
конеццикла;	
	ТекущаяДата=ТекущаяДата();

	ЗаполнитьПараметрыОбеспечения();	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ЗаполнитьПараметрыОбеспечения();	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
 ПроверитьФормулуНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПроверитьФормулуНаСервере()
	ПараметрыТовара=Новый Структура();
	ПараметрыТовара.Вставить("Номенклатура",Номенклатура);
	ПараметрыТовара.Вставить("Характеристика",Характеристика);
	ПараметрыТовара.Вставить("Склад",Склад);
	
	БазовыеПараметры=Новый Структура();
	БазовыеПараметры.Вставить("ТекущаяДата",ТекущаяДата);
	БазовыеПараметры.Вставить("СрокПоставки",СрокПоставки);
	БазовыеПараметры.Вставить("ОбеспечиваемыйПериод",ОбеспечиваемыйПериод);
	БазовыеПараметры.Вставить("Датапоставки",ДатаПоставки);
	БазовыеПараметры.Вставить("МаксЗапас",МаксимальныйЗапас);
	БазовыеПараметры.Вставить("МинЗапас",МинимальныйЗапас);
	БазовыеПараметры.Вставить("ОстатокНаСкладе",Остаток);
	БазовыеПараметры.Вставить("ЗаказыКПоступлению",ЗаказыКПоступлению);
	БазовыеПараметры.Вставить("ТрендПараметр",ТрендПараметр);
	БазовыеПараметры.Вставить("ИспользоватьПеремещения",ИспользоватьПеремещения);
	
	Алгоритм=Новый Структура();
	Алгоритм.Вставить("Показатели",Показатели.Выгрузить());
	если типФормулы=0 тогда 
		Алгоритм.Вставить("ВидФормулыМакс",ВидФормулы);
		Алгоритм.Вставить("ФормулаМакс",Формула);
	иначе
		Алгоритм.Вставить("ВидФормулыМин",ВидФормулы);
		Алгоритм.Вставить("ФормулаМин",Формула);
	конецесли;	
	Результат=Справочники.оп_АлгоритмыОбеспеченияПотребностей.РезультатРасчета(ПараметрыТовара,БазовыеПараметры,Алгоритм,типФормулы);	
КонецПроцедуры



&НаКлиенте
Процедура ОК(Команда)
		ВыбратьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура отмена(Команда)
		Модифицированность = Ложь;
	Закрыть();

КонецПроцедуры
&НаСервере
Функция ПоказателиВСписокЗначений()
	возврат Показатели.Выгрузить().ВыгрузитьКолонку("Показатель");
КонецФункции 

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОчиститьСообщения();
	
	Результаты = РезультатыРедактирования(Формула, ВидФормулы,ТипФормулы,ПоказателиВСписокЗначений());
	
	Если Результаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть(Результаты);
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция РезультатыРедактирования(ФормулаРасчета, ВидФормулыРасчета, ТипФормулыРасчета,ПоказателиСписок )
	
	Результаты = Новый Структура;
	Результаты.Вставить("Формула", ФормулаРасчета);
	Результаты.Вставить("ВидФормулы", ВидФормулыРасчета);
	Результаты.Вставить("ТипФормулы", ТипФормулыРасчета);
	Результаты.Вставить("Показатели", ПоказателиСписок);
	//ПараметрыВыполненияФормулы = РасчетЗарплатыРасширенный.ПараметрыВыполненияФормулы(Формула, Истина, НедоступныеПоказатели);

	//Если ПараметрыВыполненияФормулы = Неопределено Тогда
	//	Возврат Неопределено
	//Иначе
	//	ПоказателиФормулы = ПараметрыВыполненияФормулы.ПоказателиФормулы;
	//	Если ДополнятьРезультаты Тогда
	//		Результаты.Вставить("СведенияОПоказателях", ЗарплатаКадрыРасширенный.СведенияОПоказателяхРасчетаЗарплаты(ПоказателиФормулы));
	//		Результаты.Вставить("ЕстьПоказательРасчетнаяБаза", ПоказателиФормулы.Найти(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РасчетнаяБаза")) <> Неопределено);
	//		Результаты.Вставить("ЕстьПоказательРасчетнаяБазаСтраховыеВзносы", ПоказателиФормулы.Найти(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РасчетнаяБазаСтраховыеВзносы")) <> Неопределено);
	//		Результаты.Вставить("ЕстьПоказателиУчетаВремени", ЕстьПоказателиУчетаВремени(ПоказателиФормулы));
	//		Результаты.Вставить("ЕстьОперативныеПоказатели", ЕстьОперативныеПоказатели(ПоказателиФормулы));			
	//		Результаты.Вставить("ЗапрашиваемыеПоказатели", ЗарплатаКадрыРасширенный.ЗапрашиваемыеПоказателиВидаРасчетаПоУмолчанию(ВидРасчета, ПоказателиФормулы));
	//	КонецЕсли;
		Возврат Результаты;
	//КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДатаПоставки(Команда)
	ВставитьТекстВФормулу(" ДатаПоставки ",,3)

КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйЗапас(Команда)
	ВставитьТекстВФормулу(" МаксЗапас ",,3)
КонецПроцедуры

&НаКлиенте
Процедура МинимальныйЗапас(Команда)
	ВставитьТекстВФормулу(" МинЗапас ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ОстатокНаСкладе(Команда)
		ВставитьТекстВФормулу(" ОстатокНаСкладе ",,3)

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКПоступлению(Команда)
			ВставитьТекстВФормулу(" ЗаказыКПоступлению ",,3)

КонецПроцедуры

&НаКлиенте
Процедура ТрендПараметр(Команда)
	   	ВставитьТекстВФормулу(" ТрендПараметр ",,3)
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПеремещения(Команда)
	   	ВставитьТекстВФормулу(" ИспользоватьПеремещения ",,3)
КонецПроцедуры
